# ThreePtCenter

## Description
Returns the center of a circle passing thru 3 given points.

```pascal
FUNCTION ThreePtCenter(
				pt1 : VECTOR;
				pt2 : VECTOR;
				pt3 : VECTOR) : VECTOR;
```

```python

def vs.ThreePtCenter(pt1, pt2, pt3):
    return VECTOR
```

## Parameters
|Name|Type|Description|
|---|---|---|
|pt1|VECTOR||
|pt2|VECTOR||
|pt3|VECTOR||

## Version
Availability: from Vectorworks 2014
## Category
* Graphic Calculation